case/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xmin
    {
        type calculated;
        value uniform 0;
    }

    xmax
    {
        type calculated;
        value uniform 0;
    }

    ymin
    {
        type calculated;
        value uniform 0;
    }

    ymax
    {
        type calculated;
        value uniform 0;
    }

    zmin
    {
        type calculated;
        value uniform 0;
    }

    zmax
    {
        type calculated;
        value uniform 0;
    }
}